<a href="https://colab.research.google.com/github/ajsp2020/alura/blob/main/Pandas_IO.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Criando os nomes

In [2]:
import pandas as pd

In [8]:
nomes_m = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")
nomes_f = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")

In [11]:
print("Quantidade de nomes: " + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [12]:
frames = [nomes_f, nomes_m]

In [13]:
frames

[          nome  regiao      freq  rank sexo
 0        MARIA       0  11694738     1    F
 1          ANA       0   3079729     2    F
 2    FRANCISCA       0    721637     3    F
 3      ANTONIA       0    588783     4    F
 4      ADRIANA       0    565621     5    F
 ..         ...     ...       ...   ...  ...
 195     ROSANE       0     82203   196    F
 196    IVONETE       0     81878   197    F
 197    LUCIANE       0     81230   198    F
 198    ISADORA       0     81100   199    F
 199      NILZA       0     80128   200    F

 [200 rows x 5 columns],           nome  regiao     freq  rank sexo
 0         JOSE       0  5732508     1    M
 1         JOAO       0  2971935     2    M
 2      ANTONIO       0  2567494     3    M
 3    FRANCISCO       0  1765197     4    M
 4       CARLOS       0  1483121     5    M
 ..         ...     ...      ...   ...  ...
 195     WALTER       0    67207   196    M
 196    ARLINDO       0    66669   197    M
 197    MICHAEL       0    65736   198    M
 198     ALVARO       0    65444   199    M
 199    GEOVANE       0    65435   200    M

 [200 rows x 5 columns]]

In [16]:
nomes = pd.concat(frames)['nome'].to_frame() # Concatenando os DataFrames, aplicando a uma coluna so e convertendo para um dataframe

In [19]:
nomes.sample(5) # .sample -> pega um nome aleatório

          nome
146     WILIAN
162     ISMAEL
136     KARINA
171  TERESINHA
110       IVAN

# Incluindo os ID dos alunos

In [21]:
import numpy as np
np.random.seed(123)

In [23]:
total_alunos = len(nomes) # Qtdade de alunos
total_alunos

400

In [24]:
# Criando uma nova coluna 
nomes["id_aluno"] = np.random.permutation(total_alunos) + 1 # distribui os alunos randomicamente e aplica eles de forma aleatórias

In [25]:
nomes.sample(5)

          nome  id_aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

In [27]:
# Criando 2 domínios de email
dominios = ['@diminiodiemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos) # choice para poder escolher algum elemento da nossa lista de domínio

In [28]:
nomes.sample(5)

         nome  id_aluno              dominio
118    SANDRO        68  @servicodoemail.com
55     FLAVIO       186  @servicodoemail.com
182   CHARLES        33  @servicodoemail.com
125    VALMIR        19  @servicodoemail.com
135  ROSILENE       387  @servicodoemail.com

In [32]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower() # foi criando uma nova coluna com o email depois pegou a coluna nome transformou a coluna dominio em str e concatenou depois pegou o resultado e deixou em letra minuscula

In [33]:
nomes.sample(5)

        nome  id_aluno                 dominio                          email
38     DIEGO       294  @diminiodiemail.com.br    diego@diminiodiemail.com.br
140   NILSON       361  @diminiodiemail.com.br   nilson@diminiodiemail.com.br
117   WAGNER       140  @diminiodiemail.com.br   wagner@diminiodiemail.com.br
97   BARBARA       201  @diminiodiemail.com.br  barbara@diminiodiemail.com.br
163  NIVALDO       362  @diminiodiemail.com.br  nivaldo@diminiodiemail.com.br